---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseType
source: html/58bfde93-c63a-2cd8-7588-c2dff8b2b3f6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentBaseType Property

"Base Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentBaseType { get; }
```